//
//  JapenData.swift
//  pen
//
//  Created by Hikaru.Honda on 2020/06/21.
//  Copyright © 2020 Hikaru.Honda. All rights reserved.
//

import Foundation

let nomaruData = [
    "ノーマル", "ダブル","リバース","シングルアクセル","ハーモニック","セミリバース",
    "カウンター","パームスピン","カージオイド","シングルアクセルリバース","フィンガーレスノーマル","フィンガーレスリバース","ハーフフェイクトリバース",
    "ハーフフェイクトリバース","ハーフフェイクトノーマル","コンティニュアンスパームスピン",
    "コンティニュアンスシングルアクセルカージオイド",
]
let sonikkuData = [
    "ソニック","ソニックリバース","フェイクトソニック","フェイクトソニックリバース",
    "ソニックひねりリバース","ソニックひねり","シメトリカルソニックリバース",
    "シメトリカルソニック","スキップソニック","スキップソニックリバース","シャドウ",
    "スキップトソニックリバース","フルーエントソニック","シャドウリバース",
    "フルーエントソニックひねり","ダブルチャージ","デビルズソニック","デビルズスピン",
    "デビルズシャドウ","イーストソニック","スードウソニック","ムーンウォークソニック",
    "ダブルソニック","フェイクトシャドウ","フェイクトシャドウリバース","シャドウリバース",
    "ソニックバスト",
]
let ganmanData = [
"ガンマン","ガンマンリバース","スキップガンマン","ガトリング","チャージガトリング",
]
let pasuData = [
"パスリバース","パス","シメトリカルパス","シメトリカルパスリバース","ドラマー",
"フィンガーパス","フィンガーパスリバース","パワーパス","パワーパスリバース",
"ミラードパワーパス","ミラードパワーパスリバース",
]
let ulinmidolData = [
"ハーフウィンドミル","ハーフウィンドミルリバース","インフィニティ","インフィニティリバース",
"スキップトインフィニティ",
]
let bakkuaraundoData = [
"バックアラウンド","シングルアクセルバックアラウンド","バックアラウンドリバース",
"ネオバックアラウンド","リシャーボ","シャフィーボ","シャフィーボリバース","ネオサ233",
"zcc","ボフィーボ",
]
let tokusyukeiData = [
"トライアングルパス","シーザースピン","iteza trick","itezaピボット","iteza式コブラ",
"クーロンコンボ","ラダー","ノマライザー",
]



